# language: ru
Функция: поиск

  Сценарий: яндекс
    Дано страница яндекс маркет
#    Также проверяем что отображается строка поиска
#    Также проверяем что отображается верхний баннер с акциями
#    Также проверяем что отображается основной баннер с акциями
#    Также проверяем что отображается блок рекомендуемые товары
#    Также проверяем что отображается блок Журнал маркета
#    Также проверяем что отображается блок отзывы на лучшие товары
#    Также проверяем что отображается блок популярные бренды
#    Также проверяем что отображается блок для подписки
#    Также проверяем что отображается подвал
#    Также проверяем что отображаются боковые баннеры
#    Затем кликнем на регион
#    И во всплывающем окне вводим город "Калининград"
#    Также проверяем что отображается строка поиска
#    Также проверяем что отображается верхний баннер с акциями
#    Также проверяем что отображается основной баннер с акциями
#    Также проверяем что отображается блок рекомендуемые товары
#    Также проверяем что отображается блок Журнал маркета
#    Также проверяем что отображается блок отзывы на лучшие товары
#    Также проверяем что отображается блок популярные бренды
#    Также проверяем что отображается блок для подписки
#    Также проверяем что отображается подвал
#    Также проверяем что отображаются боковые баннеры
#    Затем кликаем на регион
#    И меняем на определять автоматически
#    Также кликаем на попап да спасибо
    Если кликаем на все категории
    То отображается меню с категориями
    Если наводим на категорию авто
    Тогда отображается меню с подкатегориями
    Затем выбираем категорию авто
    Также выбираем категорию второго уровня
#    Затем проверяем что отображается блок популярные категории
#    Затем проверяем что отображается блок популярные товары
#    Затем проверяем что отображается блок скидки
#    Также проверяем что отображается блок популярные отзывы с подкатегориями
    Затем выбираем произвольную категорию
#    Тогда проверяем что отображается блок ограничение цены
#    Также проверяем что отображается чекбокс В продаже
#    Также проверяем что отображается производитель
#    Также проверяем что отображается рейтинг магазина
#    Также проверяем что отображается способ доставки
#    Также проверяем что отображается способ оплаты
#    Также проверяем что отображается магазины
#    Также у каждого товара присутствует цена
#    Также у каждого товара присутствует предложения в список магазинов
#    Также у каждого товара присутствует отзыв
#    Если навести курсор на товар
#    То появиться кнопка добавить в избранное
#    Если добавить товар в избранное
#    То появиться верхней части появиться уведомление
#    Затем закроем уведомление
#    И флажок
#    Когда в блоке цена, в поле от устанавливаем максимальную цену поля до
#    Тогда должно присутствовать не менее одного товара
#    И очищаем поле от
#    Когда в блоке цена, в поле до устанавливаем минимальную цену поля от
#    Тогда должно присутствовать не менее одного товара
#    И очищаем поле до
#    Если выбрать произвольного производителя
#    Тогда происходит фильтрация и все товары соответствуют производителю
    Также выбираем произвольный товар
    И у выбранного товара нажимаем кнопку В магазин
#    Затем проверяем наличие названия товара и цены

#
#
#
